"""
CPF = 313.813.148-48
--------------------------------------------------------------------
3 * 10 = 30
1 * 9 = 9
3 * 8 = 24
8 * 7 = 56
1 * 6 = 6
3 * 5 = 15
1 * 4 = 4
4 * 3 = 12
8 * 2 = 16
        172
Primeiro Digito
11 - (172 % 11) = 4
11 > 9 = 0
Digito 1 = 0


3 * 11 = 33
1 * 10 = 10
3 * 9 = 27
8 * 8 = 64
1 * 7 = 7
3 * 6 = 18
1 * 5 = 5
4 * 4 = 16
8 * 3 = 24
4 = 2 = 8
        212

11 - (212 % 11) = 4
11 > 9 = 0
Digito 2 = 8
"""
#print(11 - (212 % 11))


novo_cpf = input('Digite somente os numeros do seu CPF' )
if cpf == novo_cpf:
    print('CPF Válido')
else:
    print('CPF Inválido')
